Tekla.Structures.CatalogInternal.ICDelegate.CleanAndModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.Boolean@)
DO NOT USE! For internal usage only! Clean and modify a shape.
pInput: input shape info
pIsSolid: output value for solidity of shape, true if it is a solid///
Returns: true (1) on success, false(0) otherwise